** Typically we will just be either reading csv files directly or using pandas-datareader or quandl. Consider this tutorial just a quick overview of what is possible with pandas (we won't be working with SQL or excel files in this part) **

# Data Input and Output

This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

```
- CSV
- Excel
- HTML
- SQL
```

In [1]:
import pandas as pd
import numpy as np

# Read file from various type of file
##  Output file from various type of file

```
simply read_,then tab, then select
same idea, to_,then tab, then select, need to specify the index etc>
```

In [4]:
pd.read_csv('example.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [7]:
df = pd.read_csv('example.csv')

In [8]:
df.to_csv("My_output")

In [9]:
ls

08-Data-Input-and-Output.ipynb*        Pandas - Groupby.ipynb
DataFrames Part 2.ipynb                Pandas - Missing Data.ipynb
DataFrames.ipynb                       Pandas - Operations.ipynb
Excel_Sample.xlsx*                     Pandas-DataFrames Part 3.ipynb
General_Pandas.ipynb                   Pandas-Exercises/
Merging-Joing-and-Concatenating.ipynb  example.csv*
My_output                              groupby.png
Pandas - Data Input and Output.ipynb

In [10]:
pd.read_csv('My_output')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [14]:
df.to_csv('My_output', index = False)

In [16]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [18]:
pd.read_excel('Excel_Sample.xlsx', sheet_name = 'Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [19]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [20]:
df.to_excel('Excel_Sample2.xlsx', sheet_name = 'NewSheet')

In [21]:
pd.read_excel('Excel_Sample2.xlsx')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [22]:
type(pd.read_excel('Excel_Sample2.xlsx'))

pandas.core.frame.DataFrame

# read_html
Theory: read_html will find table element in html code ASAP

## HTML

You may need to install htmllib5,lxml, and BeautifulSoup4. In your terminal/command prompt run:

    conda install lxml
    conda install html5lib
    conda install BeautifulSoup4

Then restart Jupyter Notebook.
(or use pip install if you aren't using the Anaconda Distribution)

Pandas can read table tabs off of html. For example:

In [23]:
data = pd.read_html("https://www.fdic.gov/bank/individual/failed/banklist.html")

In [24]:
data

[                                             Bank Name                City  \
 0      The Farmers and Merchants State Bank of Argonia             Argonia
 1                                  Fayette County Bank          Saint Elmo
 2    Guaranty Bank, (d/b/a BestBank in Georgia & Mi...           Milwaukee
 3                                       First NBC Bank         New Orleans
 4                                        Proficio Bank  Cottonwood Heights
 5                        Seaway Bank and Trust Company             Chicago
 6                               Harvest Community Bank          Pennsville
 7                                          Allied Bank            Mulberry
 8                         The Woodbury Banking Company            Woodbury
 9                               First CornerStone Bank     King of Prussia
 10                                  Trust Company Bank             Memphis
 11                          North Milwaukee State Bank           Milwaukee
 12                              Hometown National Bank            Longview
 13                                 The Bank of Georgia      Peachtree City
 14                                        Premier Bank              Denver
 15                                      Edgebrook Bank             Chicago
 16                              Doral Bank  En Espanol            San Juan
 17                   Capitol City Bank & Trust Company             Atlanta
 18                             Highland Community Bank             Chicago
 19                    First National Bank of Crestview           Crestview
 20                                  Northern Star Bank             Mankato
 21              Frontier Bank, FSB D/B/A El Paseo Bank         Palm Desert
 22               The National Republic Bank of Chicago             Chicago
 23                                      NBRS Financial          Rising Sun
 24                               GreenChoice Bank, fsb             Chicago
 25                            Eastside Commercial Bank             Conyers
 26                              The Freedom State Bank             Freedom
 27                                         Valley Bank     Fort Lauderdale
 28                                         Valley Bank              Moline
 29                         Slavie Federal Savings Bank             Bel Air
 ..                                                 ...                 ...
 524                                  ANB Financial, NA         Bentonville
 525                                          Hume Bank                Hume
 526                             Douglass National Bank         Kansas City
 527                                  Miami Valley Bank            Lakeview
 528                                            NetBank          Alpharetta
 529                          Metropolitan Savings Bank          Pittsburgh
 530                                    Bank of Ephraim             Ephraim
 531                                      Reliance Bank        White Plains
 532              Guaranty National Bank of Tallahassee         Tallahassee
 533                                Dollar Savings Bank              Newark
 534                               Pulaski Savings Bank        Philadelphia
 535              First National Bank of Blanchardville      Blanchardville
 536                              Southern Pacific Bank            Torrance
 537                        Farmers Bank of Cheneyville         Cheneyville
 538                                      Bank of Alamo               Alamo
 539             AmTrade International Bank  En Espanol             Atlanta
 540                     Universal Federal Savings Bank             Chicago
 541                       Connecticut Bank of Commerce            Stamford
 542                                   New Century Bank     Shelby Township
 543                              Net 1st National Bank          Boca Raton
 544                                       NextBank, NA             Phoenix
 545                           Oakwood Deposit Bank Co.             Oakwood
 546                              Bank of Sierra Blanca       Sierra Blanca
 547                      Hamilton Bank, NA  En Espanol               Miami
 548                             Sinclair National Bank            Gravette
 549                                 Superior Bank, FSB            Hinsdale
 550                                Malta National Bank               Malta
 551                    First Alliance Bank & Trust Co.          Manchester
 552                  National State Bank of Metropolis          Metropolis
 553                                   Bank of Honolulu            Honolulu

      ST   CERT                Acquiring Institution        Closing Date  \
 0    KS  17719                          Conway Bank    October 13, 2017
 1    IL   1802            United Fidelity Bank, fsb        May 26, 2017
 2    WI  30003  First-Citizens Bank & Trust Company         May 5, 2017
 3    LA  58302                         Whitney Bank      April 28, 2017
 4    UT  35495                    Cache Valley Bank       March 3, 2017
 5    IL  19328                  State Bank of Texas    January 27, 2017
 6    NJ  34951  First-Citizens Bank & Trust Company    January 13, 2017
 7    AR     91                         Today's Bank  September 23, 2016
 8    GA  11297                          United Bank     August 19, 2016
 9    PA  35312  First-Citizens Bank & Trust Company         May 6, 2016
 10   TN   9956           The Bank of Fayette County      April 29, 2016
 11   WI  20364  First-Citizens Bank & Trust Company      March 11, 2016
 12   WA  35156                       Twin City Bank     October 2, 2015
 13   GA  35259                        Fidelity Bank     October 2, 2015
 14   CO  34112            United Fidelity Bank, fsb       July 10, 2015
 15   IL  57772             Republic Bank of Chicago         May 8, 2015
 16   PR  32102         Banco Popular de Puerto Rico   February 27, 2015
 17   GA  33938  First-Citizens Bank & Trust Company   February 13, 2015
 18   IL  20290            United Fidelity Bank, fsb    January 23, 2015
 19   FL  17557                       First NBC Bank    January 16, 2015
 20   MN  34983                            BankVista   December 19, 2014
 21   CA  34738    Bank of Southern California, N.A.    November 7, 2014
 22   IL    916                  State Bank of Texas    October 24, 2014
 23   MD   4862                          Howard Bank    October 17, 2014
 24   IL  28462                 Providence Bank, LLC       July 25, 2014
 25   GA  58125            Community & Southern Bank       July 18, 2014
 26   OK  12483      Alva State Bank & Trust Company       June 27, 2014
 27   FL  21793  Landmark Bank, National Association       June 20, 2014
 28   IL  10450                  Great Southern Bank       June 20, 2014
 29   MD  32368                        Bay Bank, FSB        May 30, 2014
 ..   ..    ...                                  ...                 ...
 524  AR  33901       Pulaski Bank and Trust Company         May 9, 2008
 525  MO   1971                        Security Bank       March 7, 2008
 526  MO  24660       Liberty Bank and Trust Company    January 25, 2008
 527  OH  16848         The Citizens Banking Company     October 4, 2007
 528  GA  32575                           ING DIRECT  September 28, 2007
 529  PA  35353  Allegheny Valley Bank of Pittsburgh    February 2, 2007
 530  UT   1249                        Far West Bank       June 25, 2004
 531  NY  26778                     Union State Bank      March 19, 2004
 532  FL  26838              Hancock Bank of Florida      March 12, 2004
 533  NJ  31330                          No Acquirer   February 14, 2004
 534  PA  27203                       Earthstar Bank   November 14, 2003
 535  WI  11639                        The Park Bank         May 9, 2003
 536  CA  27094                            Beal Bank    February 7, 2003
 537  LA  16445            Sabine State Bank & Trust   December 17, 2002
 538  TN   9961                          No Acquirer    November 8, 2002
 539  GA  33784                          No Acquirer  September 30, 2002
 540  IL  29355               Chicago Community Bank       June 27, 2002
 541  CT  19183                   Hudson United Bank       June 26, 2002
 542  MI  34979                          No Acquirer      March 28, 2002
 543  FL  26652                       Bank Leumi USA       March 1, 2002
 544  AZ  22314                          No Acquirer    February 7, 2002
 545  OH   8966       The State Bank & Trust Company    February 1, 2002
 546  TX  22002     The Security State Bank of Pecos    January 18, 2002
 547  FL  24382     Israel Discount Bank of New York    January 11, 2002
 548  AR  34248                   Delta Trust & Bank   September 7, 2001
 549  IL  32646                Superior Federal, FSB       July 27, 2001
 550  OH   6629                    North Valley Bank         May 3, 2001
 551  NH  34264  Southern New Hampshire Bank & Trust    February 2, 2001
 552  IL   3815              Banterra Bank of Marion   December 14, 2000
 553  HI  21029                   Bank of the Orient    October 13, 2000

            Updated Date
 0      October 20, 2017
 1         July 26, 2017
 2         July 26, 2017
 3         July 26, 2017
 4          May 18, 2017
 5          May 18, 2017
 6          May 18, 2017
 7    September 25, 2017
 8          June 1, 2017
 9     September 6, 2016
 10    September 6, 2016
 11       March 13, 2017
 12       April 13, 2016
 13     October 24, 2016
 14      August 17, 2016
 15        July 12, 2016
 16         May 13, 2015
 17       April 21, 2015
 18    November 15, 2017
 19    November 15, 2017
 20      January 6, 2016
 21    November 10, 2016
 22      January 6, 2016
 23       March 26, 2015
 24    December 12, 2016
 25      October 6, 2017
 26       March 25, 2016
 27      October 6, 2017
 28        June 26, 2015
 29    December 12, 2016
 ..                  ...
 524     August 28, 2012
 525     August 28, 2012
 526    October 26, 2012
 527  September 12, 2016
 528     August 28, 2012
 529    October 27, 2010
 530       April 9, 2008
 531       April 9, 2008
 532        June 5, 2012
 533       April 9, 2008
 534     October 6, 2017
 535        June 5, 2012
 536    October 20, 2008
 537    October 20, 2004
 538      March 18, 2005
 539  September 11, 2006
 540     October 6, 2017
 541   February 14, 2012
 542      March 18, 2005
 543       April 9, 2008
 544    February 5, 2015
 545    October 25, 2012
 546    November 6, 2003
 547  September 21, 2015
 548     October 6, 2017
 549     August 19, 2014
 550   November 18, 2002
 551   February 18, 2003
 552      March 17, 2005
 553      March 17, 2005

 [554 rows x 7 columns]]

In [25]:
type(data)

list

In [26]:
len(data)

1

In [27]:
data[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","October 20, 2017"
1,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","July 26, 2017"
2,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","July 26, 2017"
3,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","July 26, 2017"
4,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,"March 3, 2017","May 18, 2017"
5,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,"January 27, 2017","May 18, 2017"
6,Harvest Community Bank,Pennsville,NJ,34951,First-Citizens Bank & Trust Company,"January 13, 2017","May 18, 2017"
7,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","September 25, 2017"
8,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","June 1, 2017"
9,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
10,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
11,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","March 13, 2017"
12,Hometown National Bank,Longview,WA,35156,Twin City Bank,"October 2, 2015","April 13, 2016"
13,The Bank of Georgia,Peachtree City,GA,35259,Fidelity Bank,"October 2, 2015","October 24, 2016"
14,Premier Bank,Denver,CO,34112,"United Fidelity Bank, fsb","July 10, 2015","August 17, 2016"
15,Edgebrook Bank,Chicago,IL,57772,Republic Bank of Chicago,"May 8, 2015","July 12, 2016"
16,Doral Bank En Espanol,San Juan,PR,32102,Banco Popular de Puerto Rico,"February 27, 2015","May 13, 2015"
17,Capitol City Bank & Trust Company,Atlanta,GA,33938,First-Citizens Bank & Trust Company,"February 13, 2015","April 21, 2015"
18,Highland Community Bank,Chicago,IL,20290,"United Fidelity Bank, fsb","January 23, 2015","November 15, 2017"
19,First National Bank of Crestview,Crestview,FL,17557,First NBC Bank,"January 16, 2015","November 15, 2017"
20,Northern Star Bank,Mankato,MN,34983,BankVista,"December 19, 2014","January 6, 2016"
21,"Frontier Bank, FSB D/B/A El Paseo Bank",Palm Desert,CA,34738,"Bank of Southern California, N.A.","November 7, 2014","November 10, 2016"
22,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,"October 24, 2014","January 6, 2016"
23,NBRS Financial,Rising Sun,MD,4862,Howard Bank,"October 17, 2014","March 26, 2015"
24,"GreenChoice Bank, fsb",Chicago,IL,28462,"Providence Bank, LLC","July 25, 2014","December 12, 2016"
25,Eastside Commercial Bank,Conyers,GA,58125,Community & Southern Bank,"July 18, 2014","October 6, 2017"
26,The Freedom State Bank,Freedom,OK,12483,Alva State Bank & Trust Company,"June 27, 2014","March 25, 2016"
27,Valley Bank,Fort Lauderdale,FL,21793,"Landmark Bank, National Association","June 20, 2014","October 6, 2017"
28,Valley Bank,Moline,IL,10450,Great Southern Bank,"June 20, 2014","June 26, 2015"
29,Slavie Federal Savings Bank,Bel Air,MD,32368,"Bay Bank, FSB","May 30, 2014","December 12, 2016"
...,...,...,...,...,...,...,...
524,"ANB Financial, NA",Bentonville,AR,33901,Pulaski Bank and Trust Company,"May 9, 2008","August 28, 2012"
525,Hume Bank,Hume,MO,1971,Security Bank,"March 7, 2008","August 28, 2012"
526,Douglass National Bank,Kansas City,MO,24660,Liberty Bank and Trust Company,"January 25, 2008","October 26, 2012"
527,Miami Valley Bank,Lakeview,OH,16848,The Citizens Banking Company,"October 4, 2007","September 12, 2016"
528,NetBank,Alpharetta,GA,32575,ING DIRECT,"September 28, 2007","August 28, 2012"
529,Metropolitan Savings Bank,Pittsburgh,PA,35353,Allegheny Valley Bank of Pittsburgh,"February 2, 2007","October 27, 2010"
530,Bank of Ephraim,Ephraim,UT,1249,Far West Bank,"June 25, 2004","April 9, 2008"
531,Reliance Bank,White Plains,NY,26778,Union State Bank,"March 19, 2004","April 9, 2008"
532,Guaranty National Bank of Tallahassee,Tallahassee,FL,26838,Hancock Bank of Florida,"March 12, 2004","June 5, 2012"
533,Dollar Savings Bank,Newark,NJ,31330,No Acquirer,"February 14, 2004","April 9, 2008"
534,Pulaski Savings Bank,Philadelphia,PA,27203,Earthstar Bank,"November 14, 2003","October 6, 2017"
535,First National Bank of Blanchardville,Blanchardville,WI,11639,The Park Bank,"May 9, 2003","June 5, 2012"
536,Southern Pacific Bank,Torrance,CA,27094,Beal Bank,"February 7, 2003","October 20, 2008"
537,Farmers Bank of Cheneyville,Cheneyville,LA,16445,Sabine State Bank & Trust,"December 17, 2002","October 20, 2004"
538,Bank of Alamo,Alamo,TN,9961,No Acquirer,"November 8, 2002","March 18, 2005"
539,AmTrade International Bank En Espanol,Atlanta,GA,33784,No Acquirer,"September 30, 2002","September 11, 2006"
540,Universal Federal Savings Bank,Chicago,IL,29355,Chicago Community Bank,"June 27, 2002","October 6, 2017"
541,Connecticut Bank of Commerce,Stamford,CT,19183,Hudson United Bank,"June 26, 2002","February 14, 2012"
542,New Century Bank,Shelby Township,MI,34979,No Acquirer,"March 28, 2002","March 18, 2005"
543,Net 1st National Bank,Boca Raton,FL,26652,Bank Leumi USA,"March 1, 2002","April 9, 2008"
544,"NextBank, NA",Phoenix,AZ,22314,No Acquirer,"February 7, 2002","February 5, 2015"
545,Oakwood Deposit Bank Co.,Oakwood,OH,8966,The State Bank & Trust Company,"February 1, 2002","October 25, 2012"
546,Bank of Sierra Blanca,Sierra Blanca,TX,22002,The Security State Bank of Pecos,"January 18, 2002","November 6, 2003"
547,"Hamilton Bank, NA En Espanol",Miami,FL,24382,Israel Discount Bank of New York,"January 11, 2002","September 21, 2015"
548,Sinclair National Bank,Gravette,AR,34248,Delta Trust & Bank,"September 7, 2001","October 6, 2017"
549,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
550,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
551,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
552,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
553,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [28]:
type(data[0])

pandas.core.frame.DataFrame

# Read from SQL

In [29]:
from sqlalchemy import create_engine

In [30]:
# create a very small sqllit engine in memory
engine = create_engine('sqlite:///:memory:')

In [31]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [32]:
df.to_sql('my_table', engine)

In [33]:
sqldf = pd.read_sql('my_table', con=engine)

In [34]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15